# RebarDimensionalConstraintLost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..RebarDimensionalConstraintLost Property
BuiltInFailures..::..RebarFailures Class See Also
---
Dimensional constraint on Rebar element was lost on upgrade.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarDimensionalConstraintLost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarDimensionalConstraintLost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarDimensionalConstraintLost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace